[
    {
        "subjectId":"az1x7ytn",
        "experience":"I liked that there were certain areas highlighted showing where the pitch was most off and where the volume fluctuated the most. I kind of wish there was something that showed where the audio differed from the reference audio most (for example, in terms of tempo). I think that something happened with the tempo analyzer because it seemed like it was saying my bpm was higher at a certain point which sounded slower to me than the other part. Also, during the analyzer parts the \"progress bar\" blocked the button to analyze a new recording, so I could only analyze one recording each time. I mostly felt the same about my music performance, but I think I felt a bit better about the dynamics part after using the audio analyzer.",
        "improvement":"The dynamics part helped me because I could visually see where I needed to focus on being quieter\/louder. But it would've been nice to see the graph showing the dynamics of the original clip so I could try to make mine match. The pitch part could be helpful if I took more tries to fix the parts that were off pitch. I think the tempo part might have glitched a bit.",
        "payment":"I personally wouldn't because I'm not a musician, but I can imagine that someone working on their singing would pay for it in order to practice. I honestly have no conception of how much I would pay for it, maybe $15-30?"
    },
    {
        "subjectId":"nv2lqft2",
        "experience":"I enjoyed using it. It gave me insightful feedback.",
        "improvement":"It allowed to me pinpoint where I am making mistakes",
        "payment":"I would back maximum 10 dollars a month for such a service."
    },
    {
        "subjectId":"ee2xq66p",
        "experience":"I enjoyed using the audio analyzer, but I would have wished to see the graph of each of the metrics for the original reference audio overlayed or next to my own tests, so I could have better seen where I am performing differently from the reference.",
        "improvement":"I do think it helped, as it made me more aware of how I am manipulating pitch, dynamics and tempo. ",
        "payment":"If the analysis was a bit more in depth, with the overlay features and some extra features, I think yes. For a more simple system, I would prefer a one time payment less than 10-20euros, for a more complex system, possibly a subscription of less than 15 euros a month. I think it would also be useful to have a way to make sure the audio setup can be modified in the platform itself."
    },
    {
        "subjectId":"e3c1bd68",
        "experience":"I liked the pitch visuallization, i think it is useful. I think my performance was better but i cannot compare it as i didnt analyze the first ones. It would have been nice to be able to listen to the pitches i was trying to get (like pressing the B4 note on the graoh and listening a pure B4)",
        "improvement":"I think it helped, as I was more conscious of my mistakes",
        "payment":"With more futures definately, something like a subscription fee of 2-3 dollars a month"
    }
]